//
/*
 * Напишите программу на C++, которая отобразит ваше имя и адрес (можете
 * указать фиктивные данные).
 */
//

#include "iostream"

int task1()
{
    using namespace std;
    string fullName = "Tim Hale";
    string address = "Tashkent, Uzbekistan";
    cout << "My name is " << fullName << endl;
    cout << "I live in " << address << endl;

    return 0;
}